joaocarvalhoopen/STM32F407_Discovery_simple_register_programming/test_reg_001/Inc/reg_base_addresses.h
#ifndef REG_BASE_ADDRESSES_H
#define REG_BASE_ADDRESSES_H

// This file contains the Base Addresses of all entries of the Memory Map.
// STM32F4xx register boundary addresses

// BA_ <--- All Base Address start with BA_ to facilitate code completion.

// AHB3 BUS
#define BA_FSMC_AHB3_BASE_ADDR             0xA0000000UL

// AHB2 BUS
#define BA_RNG_AHB2_BASE_ADDR              0x50060800UL
#define BA_HASH_AHB2_BASE_ADDR             0x50060400UL
#define BA_CRYP_AHB2_BASE_ADDR             0x50060000UL
#define BA_DCMI_AHB2_BASE_ADDR             0x50050000UL
#define BA_USB_OTG_FS_AHB2_BASE_ADDR       0x50000000UL

// AHB1 BUS
#define BA_USB_OTG_HS_AHB1_BASE_ADDR       0x40040000UL
#define BA_DMA2D_AHB1_BASE_ADDR            0x4002B000UL
#define BA_ETHERNET_MAC_AHB1_BASE_ADDR     0x40028000UL
#define BA_DMA2_AHB1_BASE_ADDR             0x40026400UL
#define BA_DMA1_AHB1_BASE_ADDR             0x40026000UL
#define BA_BKPSRAM_AHB1_BASE_ADDR          0x40024000UL
#define BA_FLASH_INTERF_AHB1_BASE_ADDR     0x40023C00UL
#define BA_RCC_AHB1_BASE_ADDR              0x40023800UL
#define BA_CRC_AHB1_BASE_ADDR              0x40023000UL
#define BA_GPIOK_AHB1_BASE_ADDR            0x40022800UL
#define BA_GPIOJ_AHB1_BASE_ADDR            0x40022400UL
#define BA_GPIOI_AHB1_BASE_ADDR            0x40022000UL
#define BA_GPIOH_AHB1_BASE_ADDR            0x40021C00UL
#define BA_GPIOG_AHB1_BASE_ADDR            0x40021800UL
#define BA_GPIOF_AHB1_BASE_ADDR            0x40021400UL
#define BA_GPIOE_AHB1_BASE_ADDR            0x40021000UL
#define BA_GPIOD_AHB1_BASE_ADDR            0x40020C00UL
#define BA_GPIOC_AHB1_BASE_ADDR            0x40020800UL
#define BA_GPIOB_AHB1_BASE_ADDR            0x40020400UL
#define BA_GPIOA_AHB1_BASE_ADDR            0x40020000UL

// APB2 BUS
#define BA_LCD_TFT_APB2_BASE_ADDR          0x40016800UL
#define BA_SAI1_APB2_BASE_ADDR             0x40015800UL
#define BA_SPI6_APB2_BASE_ADDR             0x40015400UL
#define BA_SPI5_APB2_BASE_ADDR             0x40015000UL
#define BA_TIM11_APB2_BASE_ADDR            0x40014800UL
#define BA_TIM10_APB2_BASE_ADDR            0x40014400UL
#define BA_TIM9_APB2_BASE_ADDR             0x40014000UL
#define BA_EXTI_APB2_BASE_ADDR             0x40013C00UL
#define BA_SYSCFG_APB2_BASE_ADDR           0x40013800UL
#define BA_SPI4_APB2_BASE_ADDR             0x40013400UL
#define BA_SPI1_APB2_BASE_ADDR             0x40013000UL
#define BA_SDIO_APB2_BASE_ADDR             0x40012C00UL
#define BA_ADC1_ADC2_ADC3_APB2_BASE_ADDR   0x40012000UL
#define BA_USART6_APB2_BASE_ADDR           0x40011400UL
#define BA_USART1_APB2_BASE_ADDR           0x40011000UL
#define BA_TIM8_APB2_BASE_ADDR             0x40010400UL
#define BA_TIM1_APB2_BASE_ADDR             0x40010000UL

// APB1 BUS
#define BA_UART8_APB1_BASE_ADDR            0x40007C00UL
#define BA_UART7_APB1_BASE_ADDR            0x40007800UL
#define BA_DAC_APB1_BASE_ADDR              0x40007400UL
#define BA_PWR_APB1_BASE_ADDR              0x40007000UL
#define BA_CAN2_APB1_BASE_ADDR             0x40006800UL
#define BA_CAN1_APB1_BASE_ADDR             0x40006400UL
#define BA_I2C3_APB1_BASE_ADDR             0x40005C00UL
#define BA_I2C2_APB1_BASE_ADDR             0x40005800UL
#define BA_I2C1_APB1_BASE_ADDR             0x40005400UL
#define BA_UART5_APB1_BASE_ADDR            0x40005000UL
#define BA_UART4_APB1_BASE_ADDR            0x40004C00UL
#define BA_USART3_APB1_BASE_ADDR           0x40004800UL
#define BA_USART2_APB1_BASE_ADDR           0x40004400UL
#define BA_I2S3_EXT_APB1_BASE_ADDR         0x40004000UL
#define BA_SPI3_AND_I2S3_APB1_BASE_ADDR    0x40003C00UL
#define BA_SPI2_AND_I2S2_APB1_BASE_ADDR    0x40003800UL
#define BA_I2S2_EXT_APB1_BASE_ADDR         0x40003400UL
#define BA_IWDG_APB1_BASE_ADDR             0x40003000UL
#define BA_WWDG_APB1_BASE_ADDR             0x40002C00UL
#define BA_RTC_AND_BKP_APB1_BASE_ADDR      0x40002800UL
#define BA_TIM14_APB1_BASE_ADDR            0x40002000UL
#define BA_TIM13_APB1_BASE_ADDR            0x40001C00UL
#define BA_TIM12_APB1_BASE_ADDR            0x40001800UL
#define BA_TIM7_APB1_BASE_ADDR             0x40001400UL
#define BA_TIM6_APB1_BASE_ADDR             0x40001000UL
#define BA_TIM5_APB1_BASE_ADDR             0x40000C00UL
#define BA_TIM4_APB1_BASE_ADDR             0x40000800UL
#define BA_TIM3_APB1_BASE_ADDR             0x40000400UL
#define BA_TIM2_APB1_BASE_ADDR             0x40000000UL


#endif
